{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "Квадратичные сортировки\n",
    "\n",
    "К -тая банка\n",
    "У Никиты есть 𝑛 банок газировки, каждая из которых имеет свой объём.\n",
    "\n",
    "Известно, что полезнее всего пить газировку, начиная от банок большего объема и переходя к всё меньшим.\n",
    "\n",
    "Помогите Никите найти 𝑘-ю по полезности банку. Встроенные алгоритмы сортировки не использовать.\n",
    "\n",
    "Входные данные\n",
    "\n",
    "В первой строке записаны два числа 1≤𝑛≤104 и 1≤𝑘≤100. Гарантируется, что 𝑘≤𝑛.\n",
    "\n",
    "Далее в строке записаны 𝑛 целых чисел 0≤𝑎𝑖≤2⋅109 — объёмы банок.\n",
    "\n",
    "Выходные данные\n",
    "\n",
    "Вывести объём 𝑘-ой в порядке полезности банки.\n",
    "\n",
    "Примеры\n",
    "Ввод:\n",
    "5 5\n",
    "1 7 2 3 2\n",
    "Вывод:\n",
    "1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "n, k = map(int, input().split())\n",
    "mas = list(map(int, input().split()))\n",
    "\n",
    "def selection(mas, n, k):\n",
    "  for i in range(n):\n",
    "    idle = i\n",
    "    for j in range (i, n):\n",
    "        if mas[idle] < mas[j]:\n",
    "          idle = j\n",
    "    mas[i], mas[idle] = mas[idle], mas[i]\n",
    "    if (i == k-1):\n",
    "         return mas[:i+1]\n",
    "print(selection(mas, n, k)[k-1])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Количество обменов\n",
    "\n",
    "Определите, сколько обменов сделает алгоритм пузырьковой сортировки по возрастанию для данного массива.\n",
    "\n",
    "Входные данные\n",
    "\n",
    "На первой строке дано число 𝑁(1≤𝑁≤1000) — количество элементов в массиве. На второй строке — сам массив. Гарантируется, что все элементы не превышают по модулю 109.\n",
    "\n",
    "Выходные данные\n",
    "\n",
    "Выведите одно число — количество обменов пузырьковой сортировки.\n",
    "\n",
    "Ввод\n",
    "5\n",
    "1 2 3 4 5 \n",
    "Вывод\n",
    "0\n",
    "Ввод\n",
    "5\n",
    "5 4 3 2 1 \n",
    "Вывод\n",
    "10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "mas = list(map(int, input().split()))\n",
    "count = 0\n",
    "cc = 0\n",
    "n = len(mas)\n",
    "unsorted = True\n",
    "while n > 1 and unsorted:\n",
    "    unsorted = False\n",
    "    for i in range(n-1):\n",
    "        if mas[i] > mas[i+1]:\n",
    "            mas[i], mas[i+1] = mas[i+1], mas[i]\n",
    "            count += 1\n",
    "            unsorted = True\n",
    "    cc += 1\n",
    "print(count)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Сортировка вставками\n",
    "\n",
    "Библиотечный метод\n",
    "Продемонстрируйте работу метода сортировки вставками по возрастанию. Для этого выведите состояние данного массива после каждой вставки на отдельных строках. Если после рассмотрения очередного элемента массив не изменился, то его выводить не нужно. Если массив упорядочен изначально, то следует не выводить ничего.\n",
    "\n",
    "Входные данные\n",
    "\n",
    "На первой строке дано число 𝑁 (1≤𝑁≤100) — количество элементов в массиве. На второй строке задан сам массив: последовательность натуральных чисел, не превышающих 109.\n",
    "\n",
    "Выходные данные\n",
    "\n",
    "Выведите строки (по количеству вставок) по 𝑁 чисел каждая."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "mas = list(map(int, input().split()))\n",
    "\n",
    "for i in range(1, n):\n",
    "    tmp = mas[i]\n",
    "    j = i -1\n",
    "    while j >= 0 and mas[j] > tmp:\n",
    "        mas[j+1] = mas[j]\n",
    "        j -=1\n",
    "    if mas[j+1] != tmp:\n",
    "        mas[j+1] = tmp\n",
    "        print(*mas)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Результаты олимпиады\n",
    "Во время проведения олимпиады каждый из участников получил свой идентификационный номер — натуральное число. Необходимо отсортировать список участников олимпиады по количеству набранных ими баллов от больших баллов к меньшим, а при равенстве баллов — по возрастанию идентификационных номеров. Встроенные алгоритмы сортировки не использовать.\n",
    "\n",
    "Входные данные\n",
    "\n",
    "На первой строке дано число 𝑁(1≤𝑁≤1000) — количество участников. На каждой следующей строке даны идентификационный номер и набранное число баллов соответствующего участника. Все числа во входном файле не превышают 105.\n",
    "\n",
    "Выходные данные\n",
    "\n",
    "Выведите исходный список в порядке убывания баллов. Если у некоторых участников одинаковые баллы, то их между собой нужно выводить в порядке возрастания идентификационных номеров.\n",
    "Ввод: \n",
    "4\n",
    "3 3\n",
    "3 1\n",
    "4 4\n",
    "2 3\n",
    "Вывод:\n",
    "4 4\n",
    "2 3\n",
    "3 3\n",
    "3 1\n",
    "\n",
    "Ввод:\n",
    "3\n",
    "101 80\n",
    "305 90\n",
    "200 14\n",
    "\n",
    "Вывод:\n",
    "305 90\n",
    "101 80\n",
    "200 14\n",
    "\n",
    "Ввод: \n",
    "3\n",
    "20 80\n",
    "30 90\n",
    "25 90\n",
    "\n",
    "Вывод:\n",
    "25 90\n",
    "30 90\n",
    "20 80\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "mas = []\n",
    "for i in range(n):\n",
    "    mas.append(list(map(int, input().split())))\n",
    "\n",
    "for i in range(n):\n",
    "    for j in range(n-1):\n",
    "        if mas[j][1] < mas[j + 1][1]:\n",
    "            mas[j], mas[j+1] = mas[j+1], mas[j]\n",
    "        elif mas[j][1] == mas[j + 1][1]:\n",
    "            if mas[j][0] > mas[j + 1][0]:\n",
    "                mas[j], mas[j+1] = mas[j+1], mas[j]\n",
    "\n",
    "for i in range(n):\n",
    "    print(mas[i][0], ' ', mas[i][1])"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "7e1998ff7f8aa20ada591c520b972326324e5ea05489af9e422744c7c09f6dad"
  },
  "kernelspec": {
   "display_name": "Python 3.10.2 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.2"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
